{
  "id": "convention_document",
  "title": "Convention Document",
  "content": "\n## 1. 목적\n\n1. 개발 표준화: 프론트엔드 개발에 일관성을 부여하여 코드의 가독성과 유지보수성을 높입니다.\n2. 팀 협업 강화: 개발자들 간의 협업을 원활하게 하고 의사소통을 개선합니다.\n3. 새로운 개발자 온보딩: 새로 합류한 개발자가 프로젝트에 빠르게 적응하고 효율적으로 개발할 수 있도록 돕습니다.\n4. 코드 품질 향상: 일관된 코딩 스타일과 최적화 기법을 적용하여 코드의 품질을 향상시킵니다.\n5. 유지보수성 강화: 일관된 구조와 명명 규칙을 통해 코드의 가독성을 높이고 유지보수를 용이하게 합니다.\n\n## 2. 코딩 스타일 가이드\n\n### 2.1. 들여쓰기\n\n1. Prettier의 기본설정으로 들여쓰기 합니다.\n\n### 2.2. 변수와 상수\n\n변수와 상수는 프론트엔드 개발에서 중요한 개념입니다. 이 섹션에서는 변수와 상수의 사용에 대한 가이드라인을 설명합니다.\n\n1. 변수명과 상수명\n   - 변수명과 상수명은 의미를 명확하게 전달할 수 있도록 짓는 것이 좋습니다.\n   - 변수명과 상수명은 영문을 사용하여 작성합니다.\n   - 여러 단어로 이루어진 경우에는 단어 사이를 카멜케이스로 구분합니다. 예: myVariable, userName\n2. 변수의 선언과 할당\n   - 변수를 선언할 때에는 let 키워드를 사용합니다. 예: let count = 0;\n   - 변수의 값은 필요에 따라 언제든지 변경할 수 있습니다.\n3. 상수의 선언과 할당\n   - 상수를 선언할 때에는 const 키워드를 사용합니다. 예: const PI = 3.14;\n   - 상수는 한 번 할당된 값은 변경할 수 없습니다.\n4. 변수와 상수의 초기화\n   - 변수와 상수는 선언과 동시에 초기값을 할당하는 것이 좋습니다.\n   - 초기화되지 않은 변수나 상수는 의도치 않은 동작을 야기할 수 있으므로 주의해야 합니다.\n\n변수와 상수는 프로그램의 데이터를 저장하고 조작하는 데에 필수적인 요소입니다. 적절하게 변수와 상수를 활용하여 가독성 높은 코드를 작성하고, 필요에 따라 값의 변경 여부를 고려하여 변수와 상수를 선택하시기 바랍니다.\n\n### 2.3. 함수와 메서드\n\n함수와 메서드는 프론트엔드 개발에서 코드의 재사용성과 모듈화를 위해 중요한 요소입니다. 이 섹션에서는 함수와 메서드의 사용에 대한 가이드라인을 제시합니다.\n\n1. 함수와 메서드의 정의\n   - 함수는 독립적으로 동작하는 코드 블록입니다. 주어진 입력을 받아서 처리하고, 결과를 반환할 수 있습니다.\n   - 메서드는 객체에 속해 있는 함수로, 객체의 상태를 조작하거나 객체의 동작을 수행합니다.\n2. 함수와 메서드의 명명 규칙\n   - 함수와 메서드의 이름은 동사 형태로 짓는 것이 일반적입니다. 예: calculateTotal, loginUser\n   - 함수와 메서드의 이름은 의미를 명확하게 전달할 수 있도록 작성해야 합니다.\n   - 여러 단어로 이루어진 경우에는 카멜 케이스(camelCase)를 사용하여 작성합니다. 예: calculateTaxAmount, loginUserWithCredentials\n3. 함수와 메서드의 매개변수\n   - 함수와 메서드는 필요한 입력값을 매개변수(parameter)로 받을 수 있습니다.\n   - 매개변수의 이름은 변수와 동일한 명명 규칙을 따르며, 입력값의 의미를 잘 표현할 수 있도록 작성해야 합니다.\n4. 함수와 메서드의 반환값\n   - 함수와 메서드는 필요에 따라 결과값을 반환할 수 있습니다.\n   - 반환값의 타입은 명확하게 정의하고, 함수 또는 메서드의 목적과 일치하는 데이터를 반환해야 합니다.\n5. 함수와 메서드의 범위\n   - 함수와 메서드는 선언된 블록(scope) 내에서 유효합니다. 함수 내부에서 선언된 변수는 함수 내에서만 사용할 수 있으며, 함수 외부에서는 접근할 수 없습니다.\n\n함수와 메서드는 코드의 재사용성과 유지보수성을 높여주는 도구입니다. 적절하게 함수와 메서드를 활용하여 코드를 구성하고, 가독성과 유연성을 고려하여 함수와 메서드를 설계하시기 바랍니다.\n\n### 2.4. 컴포넌트\n\n클래스와 컴포넌트는 객체지향 프로그래밍과 리액트 프론트엔드 개발에서 중요한 개념입니다. 이 섹션에서는 클래스와 컴포넌트의 사용에 대한 가이드라인을 제시합니다.\n\n1. 컴포넌트의 정의\n   - 컴포넌트는 UI의 독립적인 구성 요소입니다. 화면에 특정한 기능을 가진 모듈 형태로 나타낼 수 있습니다.\n   - 리액트에서 컴포넌트는 클래스로 정의될 수도 있고, 함수로 정의될 수도 있습니다. 클래스 컴포넌트와 함수형 컴포넌트가 있습니다.\n2. 컴포넌트의 명명 규칙\n   - 컴포넌트의 이름은 대문자로 시작해야 합니다.\n   - 컴포넌트의 이름은 명사나 명사구로 짓는 것이 일반적입니다. 예: User, LoginForm, Header\n3. 상속과 확장성\n   - 컴포넌트는 상속을 통해 기존의 컴포넌트를 확장할 수 있습니다. 이를 통해 코드의 재사용성과 확장성을 높일 수 있습니다.\n   - 상속을 사용할 때는 상속받은 컴포넌트의 기능을 잘 이해하고, 필요한 부분을 재정의하여 사용해야 합니다.\n\n컴포넌트는 객체지향 개념과 리액트 개발에서 핵심적인 역할을 수행합니다.컴포넌트를 잘 이해하고 적절하게 활용하여 유지보수 가능하고 확장성 있는 코드를 작성해야 합니다.\n\n### 2.5. 주석\n\n주석은 코드에 대한 설명이나 추가 정보를 제공하기 위해 사용됩니다. 올바른 주석 작성은 코드의 가독성과 유지보수성을 향상시키는 데 도움이 됩니다. 아래는 주석 작성에 대한 가이드라인입니다.\n\n1. 주석의 목적\n   - 주석의 사용을 최대한 지양하며 필수적인 경우에만 사용합니다.\n   - 중요한 사항이나 추후에 작업을 필요로하는 부분을 강조하는 주석을 작성합니다.\n2. 주석의 작성 규칙\n   - 주석은 명확하고 간결하게 작성되어야 합니다.\n   - 주석은 코드에 비해 적절한 수로 작성되어야 합니다. 과도한 주석은 코드를 가독성이 떨어뜨릴 수 있습니다.\n   - 주석은 필요한 부분에 작성되어야 하며, 필요 없는 주석은 삭제되어야 합니다.\n   - 주석은 코드의 변경에 따라 업데이트되어야 합니다.\n\n주석은 코드를 이해하고 유지보수하기 쉽게 만들어줍니다. 주석을 적절하게 작성하여 코드를 더욱 명확하고 의미 있는 형태로 유지해야 합니다.\n\n### 2.6. 네이밍 규칙\n\n일관된 네이밍 규칙은 코드의 가독성과 일관성을 유지하는 데 중요합니다. 아래는 네이밍 규칙에 대한 가이드라인입니다.\n\n1. 변수와 상수 네이밍\n   - 의미 전달: 변수와 상수의 이름은 해당 값을 잘 설명해야 합니다. 다른 개발자들이 이름만으로 변수의 역할과 용도를 이해할 수 있어야 합니다.\n   - 카멜 케이스: 변수와 상수의 이름은 카멜 케이스를 사용합니다. 첫 단어는 소문자로 시작하고, 이후 단어의 첫 글자는 대문자로 작성합니다. 예: firstName, userAge\n   - 가독성: 변수의 길이는 적절하게 설정해야 합니다. 너무 짧으면 의미 전달이 어려우며, 너무 길면 가독성이 저하될 수 있습니다.\n2. 함수와 메서드 네이밍\n   - 동사 형태: 함수와 메서드의 이름은 동사로 시작해야 합니다. 동작하는 기능을 잘 설명하는 동사를 선택합니다. 예: getUserData, calculateTotal\n   - 카멜 케이스: 함수와 메서드의 이름은 카멜 케이스를 사용합니다. 첫 단어는 소문자로 시작하고, 이후 단어의 첫 글자는 대문자로 작성합니다. 예: fetchData, updateProfile\n3. 컴포넌트 네이밍\n   - 파스칼 케이스: 컴포넌트의 이름은 파스칼 케이스를 사용합니다. 모든 단어의 첫 글자를 대문자로 작성하고, 단어 사이에는 공백이 없습니다. 예: UserService, HomePage\n   - 명확한 역할: 클래스와 컴포넌트의 이름은 해당 역할을 명확하게 전달해야 합니다. 다른 개발자들이 이름만으로 해당 클래스나 컴포넌트의 역할을 이해할 수 있어야 합니다.\n4. 폴더 디렉토리 파일 네이밍: routes와 type폴더를 제외하고 src의 모든 폴더 내의 파일의 이름은 index로 통일합니다.\n   - 컴포넌트 폴더\n     - 대문자와 파스칼 케이스: 파일의 이름은 첫 글자를 대문자로 작성하고, 단어 사이에는 공백이 없습니다\n   - 이외의 폴더\n     - 소문자와 하이픈: 파일의 이름은 소문자로 작성하며, 여러 단어는 하이픈으로 구분합니다. 예: user-service.js, home-page.tsx\n   - 파일 확장자: 파일의 확장자는 해당 파일의 유형에 맞게 설정합니다. 예: .ts, .tsx\n\n일관된 네이밍 규칙을 따르면 코드의 가독성이 향상되고 협업 시에도 일관성을 유지할 수 있습니다. 모든 개발자들이 네이밍 규칙을 공유하고 준수하도록 합니다.\n\n### 2.7. 코드 포맷팅\n\n일관된 코드 포맷팅은 가독성을 향상시키고 협업을 용이하게 만듭니다.\n\n아래는 코드 포맷팅에 대한 가이드라인이며 순서대로 구성됩니다.\n\n- 대분류(1,2,3…)를 기준으로 한 줄 띄웁니다.\n- 소분류(a,b,c…)는 띄우지 않습니다.\n\n  1. import Module\n\n     ```jsx\n     import {\n       Box,\n       Flex,\n       FormControl,\n       FormLabel,\n       Input,\n     } from \"@chakra-ui/react\";\n     import { useMemo } from \"react\";\n     import { useForm } from \"react-hook-form\";\n\n     import { CodeSelect } from \"@mobyen-frontend/common\";\n     import useUserRoles from \"features/user/hooks/useUserRoles\";\n     ```\n\n     1. 외부 모듈: from 이후를 기준, 알파벳 순으로 정렬합니다.\n     2. 내부 모듈: from 이후를 기준, 알파벳 순으로 정렬합니다.\n\n  2. interface: 스코프 내에 있는 내용을 알파벳 순서대로 정렬합니다.\n\n     ```jsx\n     interface SearchPanelProps {\n       isSearching: boolean;\n       onChange: (param: {\n         email: string | null,\n         ext: string | null,\n         mobile: string | null,\n         name: string | null,\n         tel: string | null,\n         userRole: string | null,\n         useYN: string | null,\n       }) => void;\n       onReset: () => void;\n     }\n     ```\n\n  3. defaultProps: 스코프 내에 있는 내용을 알파벳 순서대로 정렬합니다.\n\n     ```jsx\n     const defaultProps = {\n       isSearching: false,\n       onChange(_param: {\n         email: null,\n         ext: null,\n         mobile: null,\n         name: null,\n         tel: null,\n         userRole: null,\n         useYN: null,\n       }) {},\n       onReset() {},\n     };\n     ```\n\n  4. component\n\n     ```jsx\n     function SearchPanel({ isSearching, onChange, onReset }: SearchPanelProps) {\n       const { handleSubmit, register, reset, resetField } = useForm<{\n         search: string;\n         searchType?: \"email\" | \"ext\" | \"mobile\" | \"name\" | \"tel\";\n         useYN: string;\n         userRole: string;\n       }>();\n\n       const { data: userRoles } = useUserRoles({ publicYN: \"Y\" });\n\n       const handleFormSubmit = handleSubmit(\n         ({ search, searchType, userRole, useYN }) => {\n           let email = null;\n           let ext = null;\n           let mobile = null;\n           let name = null;\n           let tel = null;\n           if (searchType) {\n             email = searchType === \"email\" ? search : null;\n             ext = searchType === \"ext\" ? search : null;\n             mobile = searchType === \"mobile\" ? search : null;\n             name = searchType === \"name\" ? search : null;\n             tel = searchType === \"tel\" ? search : null;\n           } else {\n             resetField(\"search\");\n           }\n           onChange({\n             email: email ?? null,\n             ext: ext ?? null,\n             mobile: mobile ?? null,\n             name: name ?? null,\n             tel: tel ?? null,\n             userRole: userRole ? userRole : null,\n             useYN: useYN ? useYN : null,\n           });\n         }\n       );\n\n       const handleResetButtonClick = () => {\n         reset();\n         onReset();\n       };\n\n       const userRoleOptions = useMemo(\n         () =>\n           userRoles?.map((role) => ({\n             code: String(role.id),\n             name: role.name ?? \"\",\n           })) ?? [],\n         [userRoles]\n       );\n       const searchTypeOption = [\n         {\n           code: \"name\",\n           name: \"이름\",\n         },\n         {\n           code: \"email\",\n           name: \"이메일\",\n         },\n         {\n           code: \"tel\",\n           name: \"전화번호\",\n         },\n         {\n           code: \"ext\",\n           name: \"내선번호\",\n         },\n         {\n           code: \"mobile\",\n           name: \"휴대폰번호\",\n         },\n       ];\n\n       return (\n         <Flex\n           as=\"form\"\n           flexDirection=\"column\"\n           gap={2}\n           onSubmit={handleFormSubmit}\n           width=\"100%\"\n         >\n           <Box\n             borderBottomColor=\"black\"\n             borderBottomWidth=\"1px\"\n             borderTopColor=\"black\"\n             borderTopWidth=\"1px\"\n             p={3}\n           >\n             <FormControl>\n               <FormLabel fontSize=\"xs\" fontWeight=\"bold\" htmlFor=\"userRole\">\n                 검색조건\n               </FormLabel>\n               <Flex flexWrap=\"wrap\" gap={2}>\n                 <CodeSelect\n                   codes={userRoleOptions}\n                   flex={{ md: 1 }}\n                   id=\"userRole\"\n                   minWidth={{ md: \"150px\" }}\n                   maxWidth={{ lg: \"200px\" }}\n                   placeholder=\"권한\"\n                   {...register(\"userRole\")}\n                 />\n                 <CodeSelect\n                   codes={[\n                     { code: \"Y\", name: \"사용\" },\n                     { code: \"N\", name: \"미사용\" },\n                   ]}\n                   flex={{ sm: 1 }}\n                   id=\"useYN\"\n                   maxWidth={{ lg: \"200px\" }}\n                   minWidth={{ md: \"150px\" }}\n                   placeholder=\"사용여부\"\n                   {...register(\"useYN\")}\n                 />\n                 <CodeSelect\n                   codes={searchTypeOption}\n                   flex={{ sm: 1 }}\n                   id=\"searchType\"\n                   maxWidth={{ lg: \"170px\" }}\n                   minWidth={{ md: \"130px\" }}\n                   placeholder=\"검색조건\"\n                   {...register(\"searchType\")}\n                 />\n                 <Input\n                   flex={{ md: 2 }}\n                   id=\"search\"\n                   maxWidth={{ lg: \"300px\" }}\n                   minWidth={{ md: \"200px\" }}\n                   placeholder=\"검색어\"\n                   {...register(\"search\")}\n                 />\n                 <Input\n                   disabled={isSearching}\n                   hidden\n                   id=\"searchButton\"\n                   type=\"submit\"\n                 />\n                 <Input\n                   hidden\n                   id=\"resetButton\"\n                   type=\"button\"\n                   onClick={handleResetButtonClick}\n                 />\n               </Flex>\n             </FormControl>\n           </Box>\n         </Flex>\n       );\n     }\n     ```\n\n     1. 리액트 훅: 선언 명을 기준, 알파벳 순으로 정렬합니다.\n     2. 커스텀 훅: 선언 명을 기준, 알파벳 순으로 정렬합니다.\n     3. useState: 첫 번째 상태변수를 기준, 알파벳 순으로 정렬합니다.\n     4. function: 선언 명을 기준, 알파벳 순으로 정렬합니다.\n     5. useEffect\n     6. watch 함수\n\n  5. defaultProps\n\n     ```jsx\n     SearchPanel.defaultProps = defaultProps;\n     ```\n\n  6. export default\n\n     ```jsx\n     export default SearchPanel;\n     ```\n\n### 2.8. 에러 처리\n\n애플리케이션에서 발생하는 에러를 적절히 처리하는 것은 안정성과 예외 상황에 대한 대응력을 향상시킵니다. 아래는 에러 처리에 대한 가이드라인입니다.\n\n1. 예외 처리: 예외 상황이 발생할 수 있는 코드 블록에는 적절한 예외 처리를 구현합니다. 이는 try-catch 문을 사용하여 예외를 캐치하고, 적절한 로그 메시지를 출력하거나 사용자에게 에러 메시지를 표시하는 등의 처리를 수행합니다.\n2. 에러 핸들링: 애플리케이션의 최상위 수준에서 에러 핸들링을 구현합니다. 이는 예상치 못한 예외 상황이 발생했을 때 알림을 표시하고, 사용자에게 적절한 안내를 제공하는 등의 처리를 수행합니다.\n3. 로깅: 에러 발생 시 로그를 기록하고 추적 가능한 정보를 포함시킵니다. 이는 디버깅과 문제 해결에 도움을 줄 수 있습니다.\n4. 사용자 피드백: 에러 발생 시 사용자에게 적절한 피드백을 제공합니다. 이는 사용자가 문제 상황을 이해하고 대처할 수 있도록 도움을 줄 수 있습니다.\n5. 예외 처리 모듈: 애플리케이션에서 공통적으로 발생하는 예외 상황에 대한 처리를 모듈화하여 재사용성을 높일 수 있습니다.\n\n애플리케이션에서 발생할 수 있는 예외 상황을 사전에 고려하고, 적절한 에러 처리를 구현하여 안정성과 사용자 경험을 개선하는 것이 좋습니다.\n\n## 3. 프로젝트 구조\n\n### 3.1. 파일 및 폴더 구조\n\n```jsx\n- `package`: 프로젝트의 루트 디렉토리\n    - `app`: 애플리케이션의 소스 코드와 관련된 디렉토리\n        - `node_modules`: 프로젝트의 의존성 패키지들이 설치되는 디렉토리\n        - `public`: 정적 파일이 위치하는 디렉토리\n        - `src`: 소스 코드가 위치하는 디렉토리입니다.\n            - `api`: 서버 API와 통신하는 코드가 위치하는 디렉토리입니다.\n            - `assets`: 애플리케이션에서 사용되는 정적 리소스(이미지, 아이콘 등)가 위치\n            - `components`: 재사용 가능한 React 컴포넌트들이 위치하는 디렉토리\n            - `features`: 애플리케이션의 기능별로 구성된 모듈이 위치하는 디렉토리\n            - `libs`: 애플리케이션에서 사용되는 유틸리티 함수, 헬퍼 클래스 등이 위치\n            - `redux`: 리덕스의 리듀서, 액션, 미들웨어 등이 포함됩니다.\n            - `routes`: 라우팅과 관련된 코드가 위치하는 디렉토리입니다.\n            - `type`: 타입 정의 파일이 위치하는 디렉토리입니다.\n            - `App.css`: 애플리케이션 전체에 적용되는 CSS 스타일을 정의\n            - `App.test.tsx`: 애플리케이션의 테스트 코드가 위치하는 파일\n            - `index.css`: index.html 파일에서 사용되는 전역 CSS 스타일을 정의하는 파일\n            - `index.tsx`: React DOM 렌더링을 수행하는 코드가 이 파일에 포함됩니다.\n            - `react-app-env.d.ts`: Create React App에 의해 자동 생성되는 TypeScript 환경 설정 파일\n            - `reportWebVitals.ts`: 웹 애플리케이션의 성능 측정을 위한 코드가 위치하는 파일\n            - `setupProxy.js`: 개발 환경에서 프록시 설정을 위한 파일, 개발 서버와 API 서버 간의 통신을 프록시하는데 사용됩니다.\n            - `setupTest.ts`: 테스트 환경 설정을 위한 파일\n            - `theme.ts`: 애플리케이션의 테마 설정을 관리하는 파일\n    - `common`: 재사용되는 코드나 모듈들을 관리하는 디렉토리\n        - `dist`: 재사용되는 코드의 빌드 결과물이 위치하는 디렉토리\n        - `src`: 재사용되는 코드의 소스 파일들이 위치하는 디렉토리\n        - `package.json`: 재사용되는 코드의 의존성 패키지들을 관리하는 파일\n        - `tsconfig.json`: 재사용되는 코드의 TypeScript 환경 설정 파일\n```\n\n### 3.2. 모듈화와 컴포넌트 구성\n\n모듈화와 컴포넌트 구성은 코드의 재사용성과 유지보수성을 높이는 중요한 요소입니다. 아래는 모듈화와 컴포넌트 구성에 대한 가이드라인입니다.\n\n1. 모듈화:\n   - 기능 단위로 모듈을 분리하여 개발합니다. 각 모듈은 특정 기능을 수행하도록 설계되며, 관련된 코드와 리소스를 포함해야 합니다.\n   - 모듈 간의 의존성을 최소화하고, 각 모듈이 독립적으로 작동할 수 있도록 설계합니다. 이는 모듈 간의 결합도를 낮추고 유연성을 높일 수 있습니다.\n   - 모듈의 인터페이스를 명확하게 정의하고, 다른 모듈에서 재사용할 수 있는 API를 제공합니다.\n   - 모듈의 구현을 추상화하고, 내부 구현의 변경에 유연하게 대처할 수 있도록 설계합니다.\n2. 컴포넌트 구성:\n   - 컴포넌트는 UI 요소의 재사용 가능한 조합입니다. 비슷한 동작을 하는 UI 요소들을 하나의 컴포넌트로 추상화하고, 필요에 따라 다양한 속성을 통해 재사용할 수 있도록 설계합니다.\n   - 컴포넌트는 단일 책임 원칙을 준수하고, 가능한 한 작고 재사용 가능한 형태로 구성합니다. 이는 컴포넌트의 이해와 유지보수를 용이하게 합니다.\n   - 컴포넌트 간의 계층 구조를 구성하여, 복잡한 UI를 단순화하고 관리 가능한 단위로 분할합니다. 이는 코드의 가독성과 유지보수성을 향상시킵니다.\n   - 컴포넌트의 인터페이스를 명확하게 정의하고, 다른 컴포넌트와의 상호작용을 규정합니다.\n   - 컴포넌트 간의 상태 공유를 최소화하고, 필요한 데이터는 프로퍼티로 전달하여 컴포넌트 간의 독립성을 유지합니다.\n\n모듈화와 컴포넌트 구성은 코드의 구조를 개선하고, 재사용 가능한 코드의 양을 늘리는데 중요한 역할을 합니다. 적절한 모듈화와 컴포넌트 구성을 통해 개발 생산성과 코드 품질을 향상시킬 수 있습니다.\n\n### 3.3. 상태 관리\n\n상태 관리는 애플리케이션에서 데이터의 상태를 효과적으로 관리하는 것을 의미합니다. 아래는 상태 관리에 대한 가이드라인입니다.\n\n1. 단일 소스로 상태 관리하기:\n   - 애플리케이션의 모든 상태를 단일한 곳에서 관리하는 것이 중요합니다. 이를 통해 상태의 일관성을 유지하고, 데이터의 중복을 피할 수 있습니다.\n   - 상태 관리 라이브러리인 Redux 사용하여 상태를 중앙 집중화합니다.\n2. 상태의 불변성 유지:\n   - 상태는 불변성을 유지해야 합니다. 이는 상태를 직접 수정하지 않고 새로운 상태를 생성하여 업데이트하는 방식으로 작업해야 함을 의미합니다.\n3. 컴포넌트와 상태의 연결:\n   - 상태 관리 라이브러리를 활용하면 컴포넌트와 상태를 쉽게 연결할 수 있습니다. 이를 통해 상태의 변경을 자동으로 감지하고 컴포넌트를 업데이트할 수 있습니다.\n   - React의 Context API, ReactQuery 등을 활용하여 컴포넌트와 상태를 연결하고 패칭합니다.\n4. 비동기 상태 관리:\n   - 비동기 작업과 관련된 상태를 효과적으로 관리해야 합니다. API 호출, 비동기 데이터 로딩 등의 작업을 처리하는데 있어서 상태 관리 라이브러리의 비동기 처리 기능을 활용할 수 있습니다.\n   - Redux-Thunk를 사용하여 비동기 작업을 처리합니다.\n\n### 3.4. 라우팅\n\n라우팅은 사용자가 애플리케이션 내에서 다른 페이지 또는 뷰로 이동할 수 있는 기능을 제공하는 것입니다. 아래는 라우팅에 대한 가이드라인입니다.\n\n1. 라우팅 라이브러리 선택:\n   - React 애플리케이션에서 라우팅을 구현하기 위해 React Router 라우팅 라이브러리를 사용합니다.\n2. 라우팅 구성:\n   - 라우팅은 URL 경로와 해당 경로에 연결된 컴포넌트를 매핑하는 방식으로 구성됩니다.\n   - 라우터 컴포넌트를 사용하여 URL 경로와 컴포넌트를 매핑하고, 필요에 따라 중첩된 라우트와 파라미터를 처리할 수 있습니다.\n3. 네비게이션:\n   - 사용자가 다른 페이지로 이동할 수 있도록 네비게이션 기능을 구현합니다.\n   - useNavigate와 react-router-dom의 Navigate를 사용하여 라우터를 조작하여 네비게이션을 처리합니다.\n4. 보안과 권한 관리:\n   - 라우팅 시 보안 및 권한 관리가 필요한 경우, 인증 여부를 확인하고 접근 권한을 제어합니다.\n     - AppLayout: 토큰인증이 요구되는 접근 영역\n     - NonAuthenticationLayout: 비인증 상태 접근 영역\n   - 보호된 라우트, 권한 검사 및 리다이렉션과 같은 기능을 구현하여 보안과 권한 관리를 처리할 수 있습니다.\n\n라우팅은 사용자 경험을 향상시키고, 애플리케이션 내의 다양한 기능과 페이지 간의 이동을 가능하게 합니다. 적절한 라우팅 구현은 사용자의 효율성과 편의성을 높이는 데 중요한 역할을 합니다.\n\n## 4. 리소스 관리\n\n### 4.1. 이미지 및 아이콘\n\n이미지 및 아이콘은 애플리케이션에서 시각적인 요소를 추가하고 사용자 경험을 향상시키는 데 중요한 역할을 합니다. 아래는 이미지 및 아이콘 사용에 대한 가이드라인입니다.\n\n1. 이미지 사용:\n   - 애플리케이션에서 이미지를 사용하여 콘텐츠를 시각적으로 표현할 수 있습니다.\n   - 이미지를 삽입할 때는 최적화된 이미지를 사용하여 로딩 속도를 개선하고, 반응형 디자인에 맞게 이미지 크기를 조정해야 합니다.\n   - 이미지에 대체 텍스트를 제공하여 시각 장애인이나 이미지 로딩에 실패한 경우에도 콘텐츠를 이해할 수 있도록 해야 합니다.\n2. 아이콘 사용:\n   - 아이콘은 작고 간결한 그래픽 요소로서 애플리케이션에서 기능이나 상태를 시각적으로 나타내는 데 유용합니다.\n   - 아이콘 라이브러리로 Font Awesome를 사용합니다.\n   - 아이콘은 의미를 명확하게 전달해야 하므로, 사용 시 해당 아이콘의 의미와 사용 범위를 이해하고 적절하게 활용해야 합니다.\n3. 이미지 및 아이콘 관리:\n   - 이미지 및 아이콘은 프로젝트의 assets 디렉토리에서 관리됩니다.\n\n### 4.2. 스타일시트.\n\n스타일시트는 애플리케이션의 외관과 레이아웃을 결정하는 중요한 요소입니다. Chakra UI와 같은 스타일시트 라이브러리를 사용하면 일관된 디자인 시스템을 구축하고 UI 개발을 효율적으로 진행할 수 있습니다. 아래는 Chakra UI를 사용한 스타일시트 작성에 대한 가이드라인입니다.\n\n1. Chakra UI:\n   - 프로젝트에 Chakra UI가 설치되어있습니다.\n   - ChakraProvider는 애플리케이션의 최상위에 Chakra UI가 적용되어 있습니다.\n2. 컴포넌트 스타일링:\n   - Chakra UI는 다양한 사전 정의된 컴포넌트와 스타일 프로퍼티를 제공합니다. 이를 활용하여 컴포넌트를 스타일링할 수 있습니다.\n   - 스타일 프로퍼티를 사용하여 컴포넌트의 스타일을 변경하거나 커스터마이징할 수 있습니다.\n   - Chakra UI의 ThemeProvider를 사용하여 테마 설정을 관리하고 커스텀 테마를 적용할 수 있습니다.\n3. 반응형 디자인:\n   - Chakra UI는 반응형 디자인을 지원하여 다양한 장치와 화면 크기에 대응할 수 있습니다.\n   - \"@chakra-ui/media-query\" 모듈을 사용하여 미디어 쿼리를 활용할 수 있습니다. 이를 활용하여 특정 화면 크기에 대한 스타일 조정합니다.\n4. 커스텀 컴포넌트:\n   - 필요에 따라 Chakra UI의 컴포넌트를 확장하여 커스텀 컴포넌트를 생성합니다.\n   - 커스텀 컴포넌트를 생성하여 재사용성과 코드 유지 보수성을 향상킵니다.\n\nChakra UI를 사용하여 스타일시트를 작성하면 일관된 디자인 시스템을 구축하고 개발 생산성을 높일 수 있습니다. 적절하게 활용하여 사용자 인터페이스를 구성하고 디자인 요소를 일관되게 관리해야 합니다.\n\n### 4.3. 외부 라이브러리와 의존성 관리\n\n모던한 프론트엔드 애플리케이션 개발에는 종종 외부 라이브러리와 의존성이 필요합니다. 이러한 라이브러리와 의존성을 효율적으로 관리하고 활용하는 것이 중요합니다. 아래는 몇 가지 널리 사용되는 라이브러리와 의존성에 대한 간단한 소개입니다:\n\n1. emotion:\n   - emotion은 CSS-in-JS 라이브러리로, JavaScript 코드 내에서 CSS 스타일을 작성할 수 있습니다. 컴포넌트 단위로 스타일을 캡슐화하여 유지보수 및 재사용성을 높일 수 있습니다.\n2. reduxjs:\n   - reduxjs는 상태 관리 라이브러리로, 애플리케이션의 상태를 중앙에서 관리하고 예측 가능한 상태 변화를 제공합니다. redux를 사용하여 복잡한 애플리케이션 상태를 효과적으로 관리할 수 있습니다.\n3. ag-grid-react:\n   - ag-grid-react는 강력한 그리드 컴포넌트 라이브러리로, 테이블 형태의 데이터를 표시하고 조작할 수 있습니다. 유연한 기능과 다양한 커스터마이징 옵션을 제공하여 데이터 그리드를 구축할 수 있습니다.\n4. axios:\n   - axios는 HTTP 클라이언트 라이브러리로, 비동기적으로 서버와 데이터 통신을 할 수 있습니다. REST API와의 상호작용이나 데이터 요청 처리에 유용합니다.\n5. date-fns:\n   - date-fns는 JavaScript 날짜 유틸리티 라이브러리로, 날짜와 시간 관련 작업을 쉽게 처리할 수 있습니다. 날짜 형식 변환, 날짜 계산, 로컬라이징 등 다양한 기능을 제공합니다.\n6. framer-motion:\n   - framer-motion은 React용 모션 및 애니메이션 라이브러리로, 화면 전환 및 요소 애니메이션을 부드럽게 구현할 수 있습니다. 유연한 애니메이션 효과와 상호작용을 제공합니다.\n7. lodash:\n   - lodash는 JavaScript 유틸리티 라이브러리로, 다양한 유용한 함수들을 제공합니다. 배열, 객체, 함수 등을 다루는 다양한 작업에 활용할 수 있습니다.\n8. quill:\n   - quill은 리치 텍스트 에디터 라이브러리로, 사용자가 서식 있는 텍스트를 작성하고 편집할 수 있는 기능을 제공합니다. 이미지, 표, 링크 등을 삽입할 수 있는 다양한 기능을 제공합니다.\n9. react-datepicker:\n   - react-datepicker는 React용 날짜 선택 컴포넌트 라이브러리로, 사용자가 날짜를 선택하고 입력할 수 있는 기능을 제공합니다. 다양한 날짜 형식과 옵션을 설정할 수 있습니다.\n10. web-vitals:\n    - web-vitals는 웹 애플리케이션의 성능 지표를 측정하는 라이브러리로, 사용자 경험을 평가하고 개선하는 데 도움을 줍니다. 측정된 지표를 통해 성능 최적화에 대한 통찰력을 얻을 수 있습니다.\n11. xlsx:\n    - xlsx는 Excel 파일을 다루는 라이브러리로, 데이터를 읽고 쓰는 기능을 제공합니다. Excel 파일 형식을 다루는 다양한 작업을 수행할 수 있습니다.\n12. monaco-editor:\n    - monaco-editor는 웹 기반의 텍스트 편집기 라이브러리로, 문법 강조, 자동 완성, 신택스 검증 등 다양한 기능을 제공합니다. 개발자용 IDE나 코드 에디터에 적용할 수 있습니다.\n\n이러한 외부 라이브러리와 의존성을 적절하게 활용하여 개발 생산성을 향상시키고 애플리케이션에 필요한 기능을 구현할 수 있습니다. 의존성 관리와 버전 업데이트에 주의하여 안정성과 호환성을 유지하는 것이 중요합니다. 6. framer-motion:\n\n- framer-motion은 React용 모션 및 애니메이션 라이브러리로, 화면 전환 및 요소 애니메이션을 부드럽게 구현할 수 있습니다. 유연한 애니메이션 효과와 상호작용을 제공합니다.\n\n7. lodash:\n   - lodash는 JavaScript 유틸리티 라이브러리로, 다양한 유용한 함수들을 제공합니다. 배열, 객체, 함수 등을 다루는 다양한 작업에 활용할 수 있습니다.\n8. quill:\n   - quill은 리치 텍스트 에디터 라이브러리로, 사용자가 서식 있는 텍스트를 작성하고 편집할 수 있는 기능을 제공합니다. 이미지, 표, 링크 등을 삽입할 수 있는 다양한 기능을 제공합니다.\n9. react-datepicker:\n   - react-datepicker는 React용 날짜 선택 컴포넌트 라이브러리로, 사용자가 날짜를 선택하고 입력할 수 있는 기능을 제공합니다. 다양한 날짜 형식과 옵션을 설정할 수 있습니다.\n10. web-vitals:\n    - web-vitals는 웹 애플리케이션의 성능 지표를 측정하는 라이브러리로, 사용자 경험을 평가하고 개선하는 데 도움을 줍니다. 측정된 지표를 통해 성능 최적화에 대한 통찰력을 얻을 수 있습니다.\n11. xlsx:\n    - xlsx는 Excel 파일을 다루는 라이브러리로, 데이터를 읽고 쓰는 기능을 제공합니다. Excel 파일 형식을 다루는 다양한 작업을 수행할 수 있습니다.\n12. monaco-editor:\n    - monaco-editor는 웹 기반의 텍스트 편집기 라이브러리로, 문법 강조, 자동 완성, 신택스 검증 등 다양한 기능을 제공합니다. 개발자용 IDE나 코드 에디터에 적용할 수 있습니다.\n\n이러한 외부 라이브러리와 의존성을 적절하게 활용하여 개발 생산성을 향상시키고 애플리케이션에 필요한 기능을 구현할 수 있습니다. 의존성 관리와 버전 업데이트에 주의하여 안정성과 호환성을 유지하는 것이 중요합니다.\n",
  "date": "2024-03-20",
  "category": "frontend",
  "tags": [
    "Convention",
    "Documentation"
  ],
  "thumbnail": "",
  "translations": {
    "ko": {
      "title": "Convention Document",
      "description": "개발 규칙",
      "content": "<h2 id=\"heading-0\">1. 목적</h2>\n<ol>\n<li>개발 표준화: 프론트엔드 개발에 일관성을 부여하여 코드의 가독성과 유지보수성을 높입니다.</li>\n<li>팀 협업 강화: 개발자들 간의 협업을 원활하게 하고 의사소통을 개선합니다.</li>\n<li>새로운 개발자 온보딩: 새로 합류한 개발자가 프로젝트에 빠르게 적응하고 효율적으로 개발할 수 있도록 돕습니다.</li>\n<li>코드 품질 향상: 일관된 코딩 스타일과 최적화 기법을 적용하여 코드의 품질을 향상시킵니다.</li>\n<li>유지보수성 강화: 일관된 구조와 명명 규칙을 통해 코드의 가독성을 높이고 유지보수를 용이하게 합니다.</li>\n</ol>\n<h2 id=\"heading-1\">2. 코딩 스타일 가이드</h2>\n<h3 id=\"heading-2\">2.1. 들여쓰기</h3>\n<ol>\n<li>Prettier의 기본설정으로 들여쓰기 합니다.</li>\n</ol>\n<h3 id=\"heading-3\">2.2. 변수와 상수</h3>\n<p>변수와 상수는 프론트엔드 개발에서 중요한 개념입니다. 이 섹션에서는 변수와 상수의 사용에 대한 가이드라인을 설명합니다.</p>\n<ol>\n<li>변수명과 상수명\n<ul>\n<li>변수명과 상수명은 의미를 명확하게 전달할 수 있도록 짓는 것이 좋습니다.</li>\n<li>변수명과 상수명은 영문을 사용하여 작성합니다.</li>\n<li>여러 단어로 이루어진 경우에는 단어 사이를 카멜케이스로 구분합니다. 예: myVariable, userName</li>\n</ul>\n</li>\n<li>변수의 선언과 할당\n<ul>\n<li>변수를 선언할 때에는 let 키워드를 사용합니다. 예: let count = 0;</li>\n<li>변수의 값은 필요에 따라 언제든지 변경할 수 있습니다.</li>\n</ul>\n</li>\n<li>상수의 선언과 할당\n<ul>\n<li>상수를 선언할 때에는 const 키워드를 사용합니다. 예: const PI = 3.14;</li>\n<li>상수는 한 번 할당된 값은 변경할 수 없습니다.</li>\n</ul>\n</li>\n<li>변수와 상수의 초기화\n<ul>\n<li>변수와 상수는 선언과 동시에 초기값을 할당하는 것이 좋습니다.</li>\n<li>초기화되지 않은 변수나 상수는 의도치 않은 동작을 야기할 수 있으므로 주의해야 합니다.</li>\n</ul>\n</li>\n</ol>\n<p>변수와 상수는 프로그램의 데이터를 저장하고 조작하는 데에 필수적인 요소입니다. 적절하게 변수와 상수를 활용하여 가독성 높은 코드를 작성하고, 필요에 따라 값의 변경 여부를 고려하여 변수와 상수를 선택하시기 바랍니다.</p>\n<h3 id=\"heading-4\">2.3. 함수와 메서드</h3>\n<p>함수와 메서드는 프론트엔드 개발에서 코드의 재사용성과 모듈화를 위해 중요한 요소입니다. 이 섹션에서는 함수와 메서드의 사용에 대한 가이드라인을 제시합니다.</p>\n<ol>\n<li>함수와 메서드의 정의\n<ul>\n<li>함수는 독립적으로 동작하는 코드 블록입니다. 주어진 입력을 받아서 처리하고, 결과를 반환할 수 있습니다.</li>\n<li>메서드는 객체에 속해 있는 함수로, 객체의 상태를 조작하거나 객체의 동작을 수행합니다.</li>\n</ul>\n</li>\n<li>함수와 메서드의 명명 규칙\n<ul>\n<li>함수와 메서드의 이름은 동사 형태로 짓는 것이 일반적입니다. 예: calculateTotal, loginUser</li>\n<li>함수와 메서드의 이름은 의미를 명확하게 전달할 수 있도록 작성해야 합니다.</li>\n<li>여러 단어로 이루어진 경우에는 카멜 케이스(camelCase)를 사용하여 작성합니다. 예: calculateTaxAmount, loginUserWithCredentials</li>\n</ul>\n</li>\n<li>함수와 메서드의 매개변수\n<ul>\n<li>함수와 메서드는 필요한 입력값을 매개변수(parameter)로 받을 수 있습니다.</li>\n<li>매개변수의 이름은 변수와 동일한 명명 규칙을 따르며, 입력값의 의미를 잘 표현할 수 있도록 작성해야 합니다.</li>\n</ul>\n</li>\n<li>함수와 메서드의 반환값\n<ul>\n<li>함수와 메서드는 필요에 따라 결과값을 반환할 수 있습니다.</li>\n<li>반환값의 타입은 명확하게 정의하고, 함수 또는 메서드의 목적과 일치하는 데이터를 반환해야 합니다.</li>\n</ul>\n</li>\n<li>함수와 메서드의 범위\n<ul>\n<li>함수와 메서드는 선언된 블록(scope) 내에서 유효합니다. 함수 내부에서 선언된 변수는 함수 내에서만 사용할 수 있으며, 함수 외부에서는 접근할 수 없습니다.</li>\n</ul>\n</li>\n</ol>\n<p>함수와 메서드는 코드의 재사용성과 유지보수성을 높여주는 도구입니다. 적절하게 함수와 메서드를 활용하여 코드를 구성하고, 가독성과 유연성을 고려하여 함수와 메서드를 설계하시기 바랍니다.</p>\n<h3 id=\"heading-5\">2.4. 컴포넌트</h3>\n<p>클래스와 컴포넌트는 객체지향 프로그래밍과 리액트 프론트엔드 개발에서 중요한 개념입니다. 이 섹션에서는 클래스와 컴포넌트의 사용에 대한 가이드라인을 제시합니다.</p>\n<ol>\n<li>컴포넌트의 정의\n<ul>\n<li>컴포넌트는 UI의 독립적인 구성 요소입니다. 화면에 특정한 기능을 가진 모듈 형태로 나타낼 수 있습니다.</li>\n<li>리액트에서 컴포넌트는 클래스로 정의될 수도 있고, 함수로 정의될 수도 있습니다. 클래스 컴포넌트와 함수형 컴포넌트가 있습니다.</li>\n</ul>\n</li>\n<li>컴포넌트의 명명 규칙\n<ul>\n<li>컴포넌트의 이름은 대문자로 시작해야 합니다.</li>\n<li>컴포넌트의 이름은 명사나 명사구로 짓는 것이 일반적입니다. 예: User, LoginForm, Header</li>\n</ul>\n</li>\n<li>상속과 확장성\n<ul>\n<li>컴포넌트는 상속을 통해 기존의 컴포넌트를 확장할 수 있습니다. 이를 통해 코드의 재사용성과 확장성을 높일 수 있습니다.</li>\n<li>상속을 사용할 때는 상속받은 컴포넌트의 기능을 잘 이해하고, 필요한 부분을 재정의하여 사용해야 합니다.</li>\n</ul>\n</li>\n</ol>\n<p>컴포넌트는 객체지향 개념과 리액트 개발에서 핵심적인 역할을 수행합니다.컴포넌트를 잘 이해하고 적절하게 활용하여 유지보수 가능하고 확장성 있는 코드를 작성해야 합니다.</p>\n<h3 id=\"heading-6\">2.5. 주석</h3>\n<p>주석은 코드에 대한 설명이나 추가 정보를 제공하기 위해 사용됩니다. 올바른 주석 작성은 코드의 가독성과 유지보수성을 향상시키는 데 도움이 됩니다. 아래는 주석 작성에 대한 가이드라인입니다.</p>\n<ol>\n<li>주석의 목적\n<ul>\n<li>주석의 사용을 최대한 지양하며 필수적인 경우에만 사용합니다.</li>\n<li>중요한 사항이나 추후에 작업을 필요로하는 부분을 강조하는 주석을 작성합니다.</li>\n</ul>\n</li>\n<li>주석의 작성 규칙\n<ul>\n<li>주석은 명확하고 간결하게 작성되어야 합니다.</li>\n<li>주석은 코드에 비해 적절한 수로 작성되어야 합니다. 과도한 주석은 코드를 가독성이 떨어뜨릴 수 있습니다.</li>\n<li>주석은 필요한 부분에 작성되어야 하며, 필요 없는 주석은 삭제되어야 합니다.</li>\n<li>주석은 코드의 변경에 따라 업데이트되어야 합니다.</li>\n</ul>\n</li>\n</ol>\n<p>주석은 코드를 이해하고 유지보수하기 쉽게 만들어줍니다. 주석을 적절하게 작성하여 코드를 더욱 명확하고 의미 있는 형태로 유지해야 합니다.</p>\n<h3 id=\"heading-7\">2.6. 네이밍 규칙</h3>\n<p>일관된 네이밍 규칙은 코드의 가독성과 일관성을 유지하는 데 중요합니다. 아래는 네이밍 규칙에 대한 가이드라인입니다.</p>\n<ol>\n<li>변수와 상수 네이밍\n<ul>\n<li>의미 전달: 변수와 상수의 이름은 해당 값을 잘 설명해야 합니다. 다른 개발자들이 이름만으로 변수의 역할과 용도를 이해할 수 있어야 합니다.</li>\n<li>카멜 케이스: 변수와 상수의 이름은 카멜 케이스를 사용합니다. 첫 단어는 소문자로 시작하고, 이후 단어의 첫 글자는 대문자로 작성합니다. 예: firstName, userAge</li>\n<li>가독성: 변수의 길이는 적절하게 설정해야 합니다. 너무 짧으면 의미 전달이 어려우며, 너무 길면 가독성이 저하될 수 있습니다.</li>\n</ul>\n</li>\n<li>함수와 메서드 네이밍\n<ul>\n<li>동사 형태: 함수와 메서드의 이름은 동사로 시작해야 합니다. 동작하는 기능을 잘 설명하는 동사를 선택합니다. 예: getUserData, calculateTotal</li>\n<li>카멜 케이스: 함수와 메서드의 이름은 카멜 케이스를 사용합니다. 첫 단어는 소문자로 시작하고, 이후 단어의 첫 글자는 대문자로 작성합니다. 예: fetchData, updateProfile</li>\n</ul>\n</li>\n<li>컴포넌트 네이밍\n<ul>\n<li>파스칼 케이스: 컴포넌트의 이름은 파스칼 케이스를 사용합니다. 모든 단어의 첫 글자를 대문자로 작성하고, 단어 사이에는 공백이 없습니다. 예: UserService, HomePage</li>\n<li>명확한 역할: 클래스와 컴포넌트의 이름은 해당 역할을 명확하게 전달해야 합니다. 다른 개발자들이 이름만으로 해당 클래스나 컴포넌트의 역할을 이해할 수 있어야 합니다.</li>\n</ul>\n</li>\n<li>폴더 디렉토리 파일 네이밍: routes와 type폴더를 제외하고 src의 모든 폴더 내의 파일의 이름은 index로 통일합니다.\n<ul>\n<li>컴포넌트 폴더\n<ul>\n<li>대문자와 파스칼 케이스: 파일의 이름은 첫 글자를 대문자로 작성하고, 단어 사이에는 공백이 없습니다</li>\n</ul>\n</li>\n<li>이외의 폴더\n<ul>\n<li>소문자와 하이픈: 파일의 이름은 소문자로 작성하며, 여러 단어는 하이픈으로 구분합니다. 예: user-service.js, home-page.tsx</li>\n</ul>\n</li>\n<li>파일 확장자: 파일의 확장자는 해당 파일의 유형에 맞게 설정합니다. 예: .ts, .tsx</li>\n</ul>\n</li>\n</ol>\n<p>일관된 네이밍 규칙을 따르면 코드의 가독성이 향상되고 협업 시에도 일관성을 유지할 수 있습니다. 모든 개발자들이 네이밍 규칙을 공유하고 준수하도록 합니다.</p>\n<h3 id=\"heading-8\">2.7. 코드 포맷팅</h3>\n<p>일관된 코드 포맷팅은 가독성을 향상시키고 협업을 용이하게 만듭니다.</p>\n<p>아래는 코드 포맷팅에 대한 가이드라인이며 순서대로 구성됩니다.</p>\n<ul>\n<li>\n<p>대분류(1,2,3…)를 기준으로 한 줄 띄웁니다.</p>\n</li>\n<li>\n<p>소분류(a,b,c…)는 띄우지 않습니다.</p>\n<ol>\n<li>\n<p>import Module</p>\n<pre><code class=\"language-jsx\">import {\n  Box,\n  Flex,\n  FormControl,\n  FormLabel,\n  Input,\n} from \"@chakra-ui/react\";\nimport { useMemo } from \"react\";\nimport { useForm } from \"react-hook-form\";\n\nimport { CodeSelect } from \"@mobyen-frontend/common\";\nimport useUserRoles from \"features/user/hooks/useUserRoles\";\n</code></pre>\n<ol>\n<li>외부 모듈: from 이후를 기준, 알파벳 순으로 정렬합니다.</li>\n<li>내부 모듈: from 이후를 기준, 알파벳 순으로 정렬합니다.</li>\n</ol>\n</li>\n<li>\n<p>interface: 스코프 내에 있는 내용을 알파벳 순서대로 정렬합니다.</p>\n<pre><code class=\"language-jsx\">interface SearchPanelProps {\n  isSearching: boolean;\n  onChange: (param: {\n    email: string | null,\n    ext: string | null,\n    mobile: string | null,\n    name: string | null,\n    tel: string | null,\n    userRole: string | null,\n    useYN: string | null,\n  }) =&gt; void;\n  onReset: () =&gt; void;\n}\n</code></pre>\n</li>\n<li>\n<p>defaultProps: 스코프 내에 있는 내용을 알파벳 순서대로 정렬합니다.</p>\n<pre><code class=\"language-jsx\">const defaultProps = {\n  isSearching: false,\n  onChange(_param: {\n    email: null,\n    ext: null,\n    mobile: null,\n    name: null,\n    tel: null,\n    userRole: null,\n    useYN: null,\n  }) {},\n  onReset() {},\n};\n</code></pre>\n</li>\n<li>\n<p>component</p>\n<pre><code class=\"language-jsx\">function SearchPanel({ isSearching, onChange, onReset }: SearchPanelProps) {\n  const { handleSubmit, register, reset, resetField } = useForm&lt;{\n    search: string;\n    searchType?: \"email\" | \"ext\" | \"mobile\" | \"name\" | \"tel\";\n    useYN: string;\n    userRole: string;\n  }&gt;();\n\n  const { data: userRoles } = useUserRoles({ publicYN: \"Y\" });\n\n  const handleFormSubmit = handleSubmit(\n    ({ search, searchType, userRole, useYN }) =&gt; {\n      let email = null;\n      let ext = null;\n      let mobile = null;\n      let name = null;\n      let tel = null;\n      if (searchType) {\n        email = searchType === \"email\" ? search : null;\n        ext = searchType === \"ext\" ? search : null;\n        mobile = searchType === \"mobile\" ? search : null;\n        name = searchType === \"name\" ? search : null;\n        tel = searchType === \"tel\" ? search : null;\n      } else {\n        resetField(\"search\");\n      }\n      onChange({\n        email: email ?? null,\n        ext: ext ?? null,\n        mobile: mobile ?? null,\n        name: name ?? null,\n        tel: tel ?? null,\n        userRole: userRole ? userRole : null,\n        useYN: useYN ? useYN : null,\n      });\n    }\n  );\n\n  const handleResetButtonClick = () =&gt; {\n    reset();\n    onReset();\n  };\n\n  const userRoleOptions = useMemo(\n    () =&gt;\n      userRoles?.map((role) =&gt; ({\n        code: String(role.id),\n        name: role.name ?? \"\",\n      })) ?? [],\n    [userRoles]\n  );\n  const searchTypeOption = [\n    {\n      code: \"name\",\n      name: \"이름\",\n    },\n    {\n      code: \"email\",\n      name: \"이메일\",\n    },\n    {\n      code: \"tel\",\n      name: \"전화번호\",\n    },\n    {\n      code: \"ext\",\n      name: \"내선번호\",\n    },\n    {\n      code: \"mobile\",\n      name: \"휴대폰번호\",\n    },\n  ];\n\n  return (\n    &lt;Flex\n      as=\"form\"\n      flexDirection=\"column\"\n      gap={2}\n      onSubmit={handleFormSubmit}\n      width=\"100%\"\n    &gt;\n      &lt;Box\n        borderBottomColor=\"black\"\n        borderBottomWidth=\"1px\"\n        borderTopColor=\"black\"\n        borderTopWidth=\"1px\"\n        p={3}\n      &gt;\n        &lt;FormControl&gt;\n          &lt;FormLabel fontSize=\"xs\" fontWeight=\"bold\" htmlFor=\"userRole\"&gt;\n            검색조건\n          &lt;/FormLabel&gt;\n          &lt;Flex flexWrap=\"wrap\" gap={2}&gt;\n            &lt;CodeSelect\n              codes={userRoleOptions}\n              flex={{ md: 1 }}\n              id=\"userRole\"\n              minWidth={{ md: \"150px\" }}\n              maxWidth={{ lg: \"200px\" }}\n              placeholder=\"권한\"\n              {...register(\"userRole\")}\n            /&gt;\n            &lt;CodeSelect\n              codes={[\n                { code: \"Y\", name: \"사용\" },\n                { code: \"N\", name: \"미사용\" },\n              ]}\n              flex={{ sm: 1 }}\n              id=\"useYN\"\n              maxWidth={{ lg: \"200px\" }}\n              minWidth={{ md: \"150px\" }}\n              placeholder=\"사용여부\"\n              {...register(\"useYN\")}\n            /&gt;\n            &lt;CodeSelect\n              codes={searchTypeOption}\n              flex={{ sm: 1 }}\n              id=\"searchType\"\n              maxWidth={{ lg: \"170px\" }}\n              minWidth={{ md: \"130px\" }}\n              placeholder=\"검색조건\"\n              {...register(\"searchType\")}\n            /&gt;\n            &lt;Input\n              flex={{ md: 2 }}\n              id=\"search\"\n              maxWidth={{ lg: \"300px\" }}\n              minWidth={{ md: \"200px\" }}\n              placeholder=\"검색어\"\n              {...register(\"search\")}\n            /&gt;\n            &lt;Input\n              disabled={isSearching}\n              hidden\n              id=\"searchButton\"\n              type=\"submit\"\n            /&gt;\n            &lt;Input\n              hidden\n              id=\"resetButton\"\n              type=\"button\"\n              onClick={handleResetButtonClick}\n            /&gt;\n          &lt;/Flex&gt;\n        &lt;/FormControl&gt;\n      &lt;/Box&gt;\n    &lt;/Flex&gt;\n  );\n}\n</code></pre>\n<ol>\n<li>리액트 훅: 선언 명을 기준, 알파벳 순으로 정렬합니다.</li>\n<li>커스텀 훅: 선언 명을 기준, 알파벳 순으로 정렬합니다.</li>\n<li>useState: 첫 번째 상태변수를 기준, 알파벳 순으로 정렬합니다.</li>\n<li>function: 선언 명을 기준, 알파벳 순으로 정렬합니다.</li>\n<li>useEffect</li>\n<li>watch 함수</li>\n</ol>\n</li>\n<li>\n<p>defaultProps</p>\n<pre><code class=\"language-jsx\">SearchPanel.defaultProps = defaultProps;\n</code></pre>\n</li>\n<li>\n<p>export default</p>\n<pre><code class=\"language-jsx\">export default SearchPanel;\n</code></pre>\n</li>\n</ol>\n</li>\n</ul>\n<h3 id=\"heading-9\">2.8. 에러 처리</h3>\n<p>애플리케이션에서 발생하는 에러를 적절히 처리하는 것은 안정성과 예외 상황에 대한 대응력을 향상시킵니다. 아래는 에러 처리에 대한 가이드라인입니다.</p>\n<ol>\n<li>예외 처리: 예외 상황이 발생할 수 있는 코드 블록에는 적절한 예외 처리를 구현합니다. 이는 try-catch 문을 사용하여 예외를 캐치하고, 적절한 로그 메시지를 출력하거나 사용자에게 에러 메시지를 표시하는 등의 처리를 수행합니다.</li>\n<li>에러 핸들링: 애플리케이션의 최상위 수준에서 에러 핸들링을 구현합니다. 이는 예상치 못한 예외 상황이 발생했을 때 알림을 표시하고, 사용자에게 적절한 안내를 제공하는 등의 처리를 수행합니다.</li>\n<li>로깅: 에러 발생 시 로그를 기록하고 추적 가능한 정보를 포함시킵니다. 이는 디버깅과 문제 해결에 도움을 줄 수 있습니다.</li>\n<li>사용자 피드백: 에러 발생 시 사용자에게 적절한 피드백을 제공합니다. 이는 사용자가 문제 상황을 이해하고 대처할 수 있도록 도움을 줄 수 있습니다.</li>\n<li>예외 처리 모듈: 애플리케이션에서 공통적으로 발생하는 예외 상황에 대한 처리를 모듈화하여 재사용성을 높일 수 있습니다.</li>\n</ol>\n<p>애플리케이션에서 발생할 수 있는 예외 상황을 사전에 고려하고, 적절한 에러 처리를 구현하여 안정성과 사용자 경험을 개선하는 것이 좋습니다.</p>\n<h2 id=\"heading-10\">3. 프로젝트 구조</h2>\n<h3 id=\"heading-11\">3.1. 파일 및 폴더 구조</h3>\n<pre><code class=\"language-jsx\">- `package`: 프로젝트의 루트 디렉토리\n    - `app`: 애플리케이션의 소스 코드와 관련된 디렉토리\n        - `node_modules`: 프로젝트의 의존성 패키지들이 설치되는 디렉토리\n        - `public`: 정적 파일이 위치하는 디렉토리\n        - `src`: 소스 코드가 위치하는 디렉토리입니다.\n            - `api`: 서버 API와 통신하는 코드가 위치하는 디렉토리입니다.\n            - `assets`: 애플리케이션에서 사용되는 정적 리소스(이미지, 아이콘 등)가 위치\n            - `components`: 재사용 가능한 React 컴포넌트들이 위치하는 디렉토리\n            - `features`: 애플리케이션의 기능별로 구성된 모듈이 위치하는 디렉토리\n            - `libs`: 애플리케이션에서 사용되는 유틸리티 함수, 헬퍼 클래스 등이 위치\n            - `redux`: 리덕스의 리듀서, 액션, 미들웨어 등이 포함됩니다.\n            - `routes`: 라우팅과 관련된 코드가 위치하는 디렉토리입니다.\n            - `type`: 타입 정의 파일이 위치하는 디렉토리입니다.\n            - `App.css`: 애플리케이션 전체에 적용되는 CSS 스타일을 정의\n            - `App.test.tsx`: 애플리케이션의 테스트 코드가 위치하는 파일\n            - `index.css`: index.html 파일에서 사용되는 전역 CSS 스타일을 정의하는 파일\n            - `index.tsx`: React DOM 렌더링을 수행하는 코드가 이 파일에 포함됩니다.\n            - `react-app-env.d.ts`: Create React App에 의해 자동 생성되는 TypeScript 환경 설정 파일\n            - `reportWebVitals.ts`: 웹 애플리케이션의 성능 측정을 위한 코드가 위치하는 파일\n            - `setupProxy.js`: 개발 환경에서 프록시 설정을 위한 파일, 개발 서버와 API 서버 간의 통신을 프록시하는데 사용됩니다.\n            - `setupTest.ts`: 테스트 환경 설정을 위한 파일\n            - `theme.ts`: 애플리케이션의 테마 설정을 관리하는 파일\n    - `common`: 재사용되는 코드나 모듈들을 관리하는 디렉토리\n        - `dist`: 재사용되는 코드의 빌드 결과물이 위치하는 디렉토리\n        - `src`: 재사용되는 코드의 소스 파일들이 위치하는 디렉토리\n        - `package.json`: 재사용되는 코드의 의존성 패키지들을 관리하는 파일\n        - `tsconfig.json`: 재사용되는 코드의 TypeScript 환경 설정 파일\n</code></pre>\n<h3 id=\"heading-12\">3.2. 모듈화와 컴포넌트 구성</h3>\n<p>모듈화와 컴포넌트 구성은 코드의 재사용성과 유지보수성을 높이는 중요한 요소입니다. 아래는 모듈화와 컴포넌트 구성에 대한 가이드라인입니다.</p>\n<ol>\n<li>모듈화:\n<ul>\n<li>기능 단위로 모듈을 분리하여 개발합니다. 각 모듈은 특정 기능을 수행하도록 설계되며, 관련된 코드와 리소스를 포함해야 합니다.</li>\n<li>모듈 간의 의존성을 최소화하고, 각 모듈이 독립적으로 작동할 수 있도록 설계합니다. 이는 모듈 간의 결합도를 낮추고 유연성을 높일 수 있습니다.</li>\n<li>모듈의 인터페이스를 명확하게 정의하고, 다른 모듈에서 재사용할 수 있는 API를 제공합니다.</li>\n<li>모듈의 구현을 추상화하고, 내부 구현의 변경에 유연하게 대처할 수 있도록 설계합니다.</li>\n</ul>\n</li>\n<li>컴포넌트 구성:\n<ul>\n<li>컴포넌트는 UI 요소의 재사용 가능한 조합입니다. 비슷한 동작을 하는 UI 요소들을 하나의 컴포넌트로 추상화하고, 필요에 따라 다양한 속성을 통해 재사용할 수 있도록 설계합니다.</li>\n<li>컴포넌트는 단일 책임 원칙을 준수하고, 가능한 한 작고 재사용 가능한 형태로 구성합니다. 이는 컴포넌트의 이해와 유지보수를 용이하게 합니다.</li>\n<li>컴포넌트 간의 계층 구조를 구성하여, 복잡한 UI를 단순화하고 관리 가능한 단위로 분할합니다. 이는 코드의 가독성과 유지보수성을 향상시킵니다.</li>\n<li>컴포넌트의 인터페이스를 명확하게 정의하고, 다른 컴포넌트와의 상호작용을 규정합니다.</li>\n<li>컴포넌트 간의 상태 공유를 최소화하고, 필요한 데이터는 프로퍼티로 전달하여 컴포넌트 간의 독립성을 유지합니다.</li>\n</ul>\n</li>\n</ol>\n<p>모듈화와 컴포넌트 구성은 코드의 구조를 개선하고, 재사용 가능한 코드의 양을 늘리는데 중요한 역할을 합니다. 적절한 모듈화와 컴포넌트 구성을 통해 개발 생산성과 코드 품질을 향상시킬 수 있습니다.</p>\n<h3 id=\"heading-13\">3.3. 상태 관리</h3>\n<p>상태 관리는 애플리케이션에서 데이터의 상태를 효과적으로 관리하는 것을 의미합니다. 아래는 상태 관리에 대한 가이드라인입니다.</p>\n<ol>\n<li>단일 소스로 상태 관리하기:\n<ul>\n<li>애플리케이션의 모든 상태를 단일한 곳에서 관리하는 것이 중요합니다. 이를 통해 상태의 일관성을 유지하고, 데이터의 중복을 피할 수 있습니다.</li>\n<li>상태 관리 라이브러리인 Redux 사용하여 상태를 중앙 집중화합니다.</li>\n</ul>\n</li>\n<li>상태의 불변성 유지:\n<ul>\n<li>상태는 불변성을 유지해야 합니다. 이는 상태를 직접 수정하지 않고 새로운 상태를 생성하여 업데이트하는 방식으로 작업해야 함을 의미합니다.</li>\n</ul>\n</li>\n<li>컴포넌트와 상태의 연결:\n<ul>\n<li>상태 관리 라이브러리를 활용하면 컴포넌트와 상태를 쉽게 연결할 수 있습니다. 이를 통해 상태의 변경을 자동으로 감지하고 컴포넌트를 업데이트할 수 있습니다.</li>\n<li>React의 Context API, ReactQuery 등을 활용하여 컴포넌트와 상태를 연결하고 패칭합니다.</li>\n</ul>\n</li>\n<li>비동기 상태 관리:\n<ul>\n<li>비동기 작업과 관련된 상태를 효과적으로 관리해야 합니다. API 호출, 비동기 데이터 로딩 등의 작업을 처리하는데 있어서 상태 관리 라이브러리의 비동기 처리 기능을 활용할 수 있습니다.</li>\n<li>Redux-Thunk를 사용하여 비동기 작업을 처리합니다.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"heading-14\">3.4. 라우팅</h3>\n<p>라우팅은 사용자가 애플리케이션 내에서 다른 페이지 또는 뷰로 이동할 수 있는 기능을 제공하는 것입니다. 아래는 라우팅에 대한 가이드라인입니다.</p>\n<ol>\n<li>라우팅 라이브러리 선택:\n<ul>\n<li>React 애플리케이션에서 라우팅을 구현하기 위해 React Router 라우팅 라이브러리를 사용합니다.</li>\n</ul>\n</li>\n<li>라우팅 구성:\n<ul>\n<li>라우팅은 URL 경로와 해당 경로에 연결된 컴포넌트를 매핑하는 방식으로 구성됩니다.</li>\n<li>라우터 컴포넌트를 사용하여 URL 경로와 컴포넌트를 매핑하고, 필요에 따라 중첩된 라우트와 파라미터를 처리할 수 있습니다.</li>\n</ul>\n</li>\n<li>네비게이션:\n<ul>\n<li>사용자가 다른 페이지로 이동할 수 있도록 네비게이션 기능을 구현합니다.</li>\n<li>useNavigate와 react-router-dom의 Navigate를 사용하여 라우터를 조작하여 네비게이션을 처리합니다.</li>\n</ul>\n</li>\n<li>보안과 권한 관리:\n<ul>\n<li>라우팅 시 보안 및 권한 관리가 필요한 경우, 인증 여부를 확인하고 접근 권한을 제어합니다.\n<ul>\n<li>AppLayout: 토큰인증이 요구되는 접근 영역</li>\n<li>NonAuthenticationLayout: 비인증 상태 접근 영역</li>\n</ul>\n</li>\n<li>보호된 라우트, 권한 검사 및 리다이렉션과 같은 기능을 구현하여 보안과 권한 관리를 처리할 수 있습니다.</li>\n</ul>\n</li>\n</ol>\n<p>라우팅은 사용자 경험을 향상시키고, 애플리케이션 내의 다양한 기능과 페이지 간의 이동을 가능하게 합니다. 적절한 라우팅 구현은 사용자의 효율성과 편의성을 높이는 데 중요한 역할을 합니다.</p>\n<h2 id=\"heading-15\">4. 리소스 관리</h2>\n<h3 id=\"heading-16\">4.1. 이미지 및 아이콘</h3>\n<p>이미지 및 아이콘은 애플리케이션에서 시각적인 요소를 추가하고 사용자 경험을 향상시키는 데 중요한 역할을 합니다. 아래는 이미지 및 아이콘 사용에 대한 가이드라인입니다.</p>\n<ol>\n<li>이미지 사용:\n<ul>\n<li>애플리케이션에서 이미지를 사용하여 콘텐츠를 시각적으로 표현할 수 있습니다.</li>\n<li>이미지를 삽입할 때는 최적화된 이미지를 사용하여 로딩 속도를 개선하고, 반응형 디자인에 맞게 이미지 크기를 조정해야 합니다.</li>\n<li>이미지에 대체 텍스트를 제공하여 시각 장애인이나 이미지 로딩에 실패한 경우에도 콘텐츠를 이해할 수 있도록 해야 합니다.</li>\n</ul>\n</li>\n<li>아이콘 사용:\n<ul>\n<li>아이콘은 작고 간결한 그래픽 요소로서 애플리케이션에서 기능이나 상태를 시각적으로 나타내는 데 유용합니다.</li>\n<li>아이콘 라이브러리로 Font Awesome를 사용합니다.</li>\n<li>아이콘은 의미를 명확하게 전달해야 하므로, 사용 시 해당 아이콘의 의미와 사용 범위를 이해하고 적절하게 활용해야 합니다.</li>\n</ul>\n</li>\n<li>이미지 및 아이콘 관리:\n<ul>\n<li>이미지 및 아이콘은 프로젝트의 assets 디렉토리에서 관리됩니다.</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"heading-17\">4.2. 스타일시트.</h3>\n<p>스타일시트는 애플리케이션의 외관과 레이아웃을 결정하는 중요한 요소입니다. Chakra UI와 같은 스타일시트 라이브러리를 사용하면 일관된 디자인 시스템을 구축하고 UI 개발을 효율적으로 진행할 수 있습니다. 아래는 Chakra UI를 사용한 스타일시트 작성에 대한 가이드라인입니다.</p>\n<ol>\n<li>Chakra UI:\n<ul>\n<li>프로젝트에 Chakra UI가 설치되어있습니다.</li>\n<li>ChakraProvider는 애플리케이션의 최상위에 Chakra UI가 적용되어 있습니다.</li>\n</ul>\n</li>\n<li>컴포넌트 스타일링:\n<ul>\n<li>Chakra UI는 다양한 사전 정의된 컴포넌트와 스타일 프로퍼티를 제공합니다. 이를 활용하여 컴포넌트를 스타일링할 수 있습니다.</li>\n<li>스타일 프로퍼티를 사용하여 컴포넌트의 스타일을 변경하거나 커스터마이징할 수 있습니다.</li>\n<li>Chakra UI의 ThemeProvider를 사용하여 테마 설정을 관리하고 커스텀 테마를 적용할 수 있습니다.</li>\n</ul>\n</li>\n<li>반응형 디자인:\n<ul>\n<li>Chakra UI는 반응형 디자인을 지원하여 다양한 장치와 화면 크기에 대응할 수 있습니다.</li>\n<li>\"@chakra-ui/media-query\" 모듈을 사용하여 미디어 쿼리를 활용할 수 있습니다. 이를 활용하여 특정 화면 크기에 대한 스타일 조정합니다.</li>\n</ul>\n</li>\n<li>커스텀 컴포넌트:\n<ul>\n<li>필요에 따라 Chakra UI의 컴포넌트를 확장하여 커스텀 컴포넌트를 생성합니다.</li>\n<li>커스텀 컴포넌트를 생성하여 재사용성과 코드 유지 보수성을 향상킵니다.</li>\n</ul>\n</li>\n</ol>\n<p>Chakra UI를 사용하여 스타일시트를 작성하면 일관된 디자인 시스템을 구축하고 개발 생산성을 높일 수 있습니다. 적절하게 활용하여 사용자 인터페이스를 구성하고 디자인 요소를 일관되게 관리해야 합니다.</p>\n<h3 id=\"heading-18\">4.3. 외부 라이브러리와 의존성 관리</h3>\n<p>모던한 프론트엔드 애플리케이션 개발에는 종종 외부 라이브러리와 의존성이 필요합니다. 이러한 라이브러리와 의존성을 효율적으로 관리하고 활용하는 것이 중요합니다. 아래는 몇 가지 널리 사용되는 라이브러리와 의존성에 대한 간단한 소개입니다:</p>\n<ol>\n<li>emotion:\n<ul>\n<li>emotion은 CSS-in-JS 라이브러리로, JavaScript 코드 내에서 CSS 스타일을 작성할 수 있습니다. 컴포넌트 단위로 스타일을 캡슐화하여 유지보수 및 재사용성을 높일 수 있습니다.</li>\n</ul>\n</li>\n<li>reduxjs:\n<ul>\n<li>reduxjs는 상태 관리 라이브러리로, 애플리케이션의 상태를 중앙에서 관리하고 예측 가능한 상태 변화를 제공합니다. redux를 사용하여 복잡한 애플리케이션 상태를 효과적으로 관리할 수 있습니다.</li>\n</ul>\n</li>\n<li>ag-grid-react:\n<ul>\n<li>ag-grid-react는 강력한 그리드 컴포넌트 라이브러리로, 테이블 형태의 데이터를 표시하고 조작할 수 있습니다. 유연한 기능과 다양한 커스터마이징 옵션을 제공하여 데이터 그리드를 구축할 수 있습니다.</li>\n</ul>\n</li>\n<li>axios:\n<ul>\n<li>axios는 HTTP 클라이언트 라이브러리로, 비동기적으로 서버와 데이터 통신을 할 수 있습니다. REST API와의 상호작용이나 데이터 요청 처리에 유용합니다.</li>\n</ul>\n</li>\n<li>date-fns:\n<ul>\n<li>date-fns는 JavaScript 날짜 유틸리티 라이브러리로, 날짜와 시간 관련 작업을 쉽게 처리할 수 있습니다. 날짜 형식 변환, 날짜 계산, 로컬라이징 등 다양한 기능을 제공합니다.</li>\n</ul>\n</li>\n<li>framer-motion:\n<ul>\n<li>framer-motion은 React용 모션 및 애니메이션 라이브러리로, 화면 전환 및 요소 애니메이션을 부드럽게 구현할 수 있습니다. 유연한 애니메이션 효과와 상호작용을 제공합니다.</li>\n</ul>\n</li>\n<li>lodash:\n<ul>\n<li>lodash는 JavaScript 유틸리티 라이브러리로, 다양한 유용한 함수들을 제공합니다. 배열, 객체, 함수 등을 다루는 다양한 작업에 활용할 수 있습니다.</li>\n</ul>\n</li>\n<li>quill:\n<ul>\n<li>quill은 리치 텍스트 에디터 라이브러리로, 사용자가 서식 있는 텍스트를 작성하고 편집할 수 있는 기능을 제공합니다. 이미지, 표, 링크 등을 삽입할 수 있는 다양한 기능을 제공합니다.</li>\n</ul>\n</li>\n<li>react-datepicker:\n<ul>\n<li>react-datepicker는 React용 날짜 선택 컴포넌트 라이브러리로, 사용자가 날짜를 선택하고 입력할 수 있는 기능을 제공합니다. 다양한 날짜 형식과 옵션을 설정할 수 있습니다.</li>\n</ul>\n</li>\n<li>web-vitals:\n<ul>\n<li>web-vitals는 웹 애플리케이션의 성능 지표를 측정하는 라이브러리로, 사용자 경험을 평가하고 개선하는 데 도움을 줍니다. 측정된 지표를 통해 성능 최적화에 대한 통찰력을 얻을 수 있습니다.</li>\n</ul>\n</li>\n<li>xlsx:\n<ul>\n<li>xlsx는 Excel 파일을 다루는 라이브러리로, 데이터를 읽고 쓰는 기능을 제공합니다. Excel 파일 형식을 다루는 다양한 작업을 수행할 수 있습니다.</li>\n</ul>\n</li>\n<li>monaco-editor:\n<ul>\n<li>monaco-editor는 웹 기반의 텍스트 편집기 라이브러리로, 문법 강조, 자동 완성, 신택스 검증 등 다양한 기능을 제공합니다. 개발자용 IDE나 코드 에디터에 적용할 수 있습니다.</li>\n</ul>\n</li>\n</ol>\n<p>이러한 외부 라이브러리와 의존성을 적절하게 활용하여 개발 생산성을 향상시키고 애플리케이션에 필요한 기능을 구현할 수 있습니다. 의존성 관리와 버전 업데이트에 주의하여 안정성과 호환성을 유지하는 것이 중요합니다. 6. framer-motion:</p>\n<ul>\n<li>framer-motion은 React용 모션 및 애니메이션 라이브러리로, 화면 전환 및 요소 애니메이션을 부드럽게 구현할 수 있습니다. 유연한 애니메이션 효과와 상호작용을 제공합니다.</li>\n</ul>\n<ol start=\"7\">\n<li>lodash:\n<ul>\n<li>lodash는 JavaScript 유틸리티 라이브러리로, 다양한 유용한 함수들을 제공합니다. 배열, 객체, 함수 등을 다루는 다양한 작업에 활용할 수 있습니다.</li>\n</ul>\n</li>\n<li>quill:\n<ul>\n<li>quill은 리치 텍스트 에디터 라이브러리로, 사용자가 서식 있는 텍스트를 작성하고 편집할 수 있는 기능을 제공합니다. 이미지, 표, 링크 등을 삽입할 수 있는 다양한 기능을 제공합니다.</li>\n</ul>\n</li>\n<li>react-datepicker:\n<ul>\n<li>react-datepicker는 React용 날짜 선택 컴포넌트 라이브러리로, 사용자가 날짜를 선택하고 입력할 수 있는 기능을 제공합니다. 다양한 날짜 형식과 옵션을 설정할 수 있습니다.</li>\n</ul>\n</li>\n<li>web-vitals:\n<ul>\n<li>web-vitals는 웹 애플리케이션의 성능 지표를 측정하는 라이브러리로, 사용자 경험을 평가하고 개선하는 데 도움을 줍니다. 측정된 지표를 통해 성능 최적화에 대한 통찰력을 얻을 수 있습니다.</li>\n</ul>\n</li>\n<li>xlsx:\n<ul>\n<li>xlsx는 Excel 파일을 다루는 라이브러리로, 데이터를 읽고 쓰는 기능을 제공합니다. Excel 파일 형식을 다루는 다양한 작업을 수행할 수 있습니다.</li>\n</ul>\n</li>\n<li>monaco-editor:\n<ul>\n<li>monaco-editor는 웹 기반의 텍스트 편집기 라이브러리로, 문법 강조, 자동 완성, 신택스 검증 등 다양한 기능을 제공합니다. 개발자용 IDE나 코드 에디터에 적용할 수 있습니다.</li>\n</ul>\n</li>\n</ol>\n<p>이러한 외부 라이브러리와 의존성을 적절하게 활용하여 개발 생산성을 향상시키고 애플리케이션에 필요한 기능을 구현할 수 있습니다. 의존성 관리와 버전 업데이트에 주의하여 안정성과 호환성을 유지하는 것이 중요합니다.</p>\n",
      "tocItems": [
        {
          "id": "heading-0",
          "text": "1. 목적",
          "level": 2,
          "isMainTopic": true,
          "position": 0
        },
        {
          "id": "heading-1",
          "text": "2. 코딩 스타일 가이드",
          "level": 2,
          "isMainTopic": true,
          "position": 50
        },
        {
          "id": "heading-2",
          "text": "2.1. 들여쓰기",
          "level": 3,
          "isMainTopic": false,
          "position": 100
        },
        {
          "id": "heading-3",
          "text": "2.2. 변수와 상수",
          "level": 3,
          "isMainTopic": false,
          "position": 150
        },
        {
          "id": "heading-4",
          "text": "2.3. 함수와 메서드",
          "level": 3,
          "isMainTopic": false,
          "position": 200
        },
        {
          "id": "heading-5",
          "text": "2.4. 컴포넌트",
          "level": 3,
          "isMainTopic": false,
          "position": 250
        },
        {
          "id": "heading-6",
          "text": "2.5. 주석",
          "level": 3,
          "isMainTopic": false,
          "position": 300
        },
        {
          "id": "heading-7",
          "text": "2.6. 네이밍 규칙",
          "level": 3,
          "isMainTopic": false,
          "position": 350
        },
        {
          "id": "heading-8",
          "text": "2.7. 코드 포맷팅",
          "level": 3,
          "isMainTopic": false,
          "position": 400
        },
        {
          "id": "heading-9",
          "text": "2.8. 에러 처리",
          "level": 3,
          "isMainTopic": false,
          "position": 450
        },
        {
          "id": "heading-10",
          "text": "3. 프로젝트 구조",
          "level": 2,
          "isMainTopic": true,
          "position": 500
        },
        {
          "id": "heading-11",
          "text": "3.1. 파일 및 폴더 구조",
          "level": 3,
          "isMainTopic": false,
          "position": 550
        },
        {
          "id": "heading-12",
          "text": "3.2. 모듈화와 컴포넌트 구성",
          "level": 3,
          "isMainTopic": false,
          "position": 600
        },
        {
          "id": "heading-13",
          "text": "3.3. 상태 관리",
          "level": 3,
          "isMainTopic": false,
          "position": 650
        },
        {
          "id": "heading-14",
          "text": "3.4. 라우팅",
          "level": 3,
          "isMainTopic": false,
          "position": 700
        },
        {
          "id": "heading-15",
          "text": "4. 리소스 관리",
          "level": 2,
          "isMainTopic": true,
          "position": 750
        },
        {
          "id": "heading-16",
          "text": "4.1. 이미지 및 아이콘",
          "level": 3,
          "isMainTopic": false,
          "position": 800
        },
        {
          "id": "heading-17",
          "text": "4.2. 스타일시트.",
          "level": 3,
          "isMainTopic": false,
          "position": 850
        },
        {
          "id": "heading-18",
          "text": "4.3. 외부 라이브러리와 의존성 관리",
          "level": 3,
          "isMainTopic": false,
          "position": 900
        }
      ]
    },
    "en": {
      "title": "Convention Document",
      "description": "Development Rules",
      "content": "<h2 id=\"heading-0\">1. Purpose</h2>\n<ol>\n<li>Development Standardization: Provide consistency in frontend development to improve code readability and maintainability.</li>\n<li>Team Collaboration Enhancement: Facilitate collaboration between developers and improve communication.</li>\n<li>New Developer Onboarding: Help newly joined developers quickly adapt to the project and develop efficiently.</li>\n<li>Code Quality Improvement: Enhance code quality through consistent coding styles and optimization techniques.</li>\n<li>Maintainability Enhancement: Improve code readability and ease maintenance through consistent structure and naming conventions.</li>\n</ol>\n<h2 id=\"heading-1\">2. Coding Style Guide</h2>\n<h3 id=\"heading-2\">2.1. Indentation</h3>\n<ol>\n<li>Use Prettier's default settings for indentation.</li>\n</ol>\n<h3 id=\"heading-3\">2.2. Variables and Constants</h3>\n<p>Variables and constants are important concepts in frontend development. This section explains guidelines for using variables and constants.</p>\n<ol>\n<li>Variable and Constant Names\n<ul>\n<li>Variable and constant names should be chosen to clearly convey their meaning.</li>\n<li>Variable and constant names should be written in English.</li>\n<li>For multi-word names, use camelCase to separate words. Example: myVariable, userName</li>\n</ul>\n</li>\n<li>Variable Declaration and Assignment\n<ul>\n<li>Use the let keyword when declaring variables. Example: let count = 0;</li>\n<li>Variable values can be changed whenever needed.</li>\n</ul>\n</li>\n<li>Constant Declaration and Assignment\n<ul>\n<li>Use the const keyword when declaring constants. Example: const PI = 3.14;</li>\n<li>Constants cannot be changed once assigned.</li>\n</ul>\n</li>\n<li>Variable and Constant Initialization\n<ul>\n<li>It's recommended to assign initial values when declaring variables and constants.</li>\n<li>Uninitialized variables or constants can cause unintended behavior and should be avoided.</li>\n</ul>\n</li>\n</ol>\n<p>Variables and constants are essential elements for storing and manipulating program data. Use variables and constants appropriately to write readable code, and choose between them considering whether values need to be mutable.</p>\n<h3 id=\"heading-4\">2.3. Functions and Methods</h3>\n<p>Functions and methods are important elements for code reusability and modularity in frontend development. This section provides guidelines for using functions and methods.</p>\n<ol>\n<li>Function and Method Definition\n<ul>\n<li>Functions are independent code blocks that can receive input, process it, and return results.</li>\n<li>Methods are functions that belong to objects, manipulating object state or performing object behavior.</li>\n</ul>\n</li>\n<li>Function and Method Naming Conventions\n<ul>\n<li>Function and method names typically take verb forms. Example: calculateTotal, loginUser</li>\n<li>Function and method names should clearly convey their purpose.</li>\n<li>For multi-word names, use camelCase. Example: calculateTaxAmount, loginUserWithCredentials</li>\n</ul>\n</li>\n<li>Function and Method Parameters\n<ul>\n<li>Functions and methods can receive input values as parameters.</li>\n<li>Parameter names should follow the same naming conventions as variables and clearly express the meaning of input values.</li>\n</ul>\n</li>\n<li>Function and Method Return Values\n<ul>\n<li>Functions and methods can return results as needed.</li>\n<li>Return value types should be clearly defined and return data that matches the function or method's purpose.</li>\n</ul>\n</li>\n<li>Function and Method Scope\n<ul>\n<li>Functions and methods are valid within their declared block (scope). Variables declared inside a function can only be used within that function and cannot be accessed from outside.</li>\n</ul>\n</li>\n</ol>\n<p>Functions and methods are tools that enhance code reusability and maintainability. Structure your code using appropriate functions and methods, and design them considering readability and flexibility.</p>\n<h3 id=\"heading-5\">2.4. Components</h3>\n<p>Classes and components are important concepts in object-oriented programming and React frontend development. This section provides guidelines for using classes and components.</p>\n<ol>\n<li>Component Definition\n<ul>\n<li>Components are independent UI elements. They can be represented as modules with specific functionality on the screen.</li>\n<li>In React, components can be defined as either classes or functions. There are class components and functional components.</li>\n</ul>\n</li>\n<li>Component Naming Conventions\n<ul>\n<li>Component names must start with a capital letter.</li>\n<li>Component names are typically nouns or noun phrases. Example: User, LoginForm, Header</li>\n</ul>\n</li>\n<li>Inheritance and Extensibility\n<ul>\n<li>Components can be extended through inheritance. This enhances code reusability and extensibility.</li>\n<li>When using inheritance, understand the functionality of the inherited component well and redefine necessary parts.</li>\n</ul>\n</li>\n</ol>\n<p>Components play a crucial role in object-oriented concepts and React development. Understand components well and use them appropriately to write maintainable and extensible code.</p>\n<h3 id=\"heading-6\">2.5. Comments</h3>\n<p>Comments are used to provide explanations or additional information about code. Proper comment writing helps improve code readability and maintainability. Below are guidelines for writing comments.</p>\n<ol>\n<li>Comment Purpose\n<ul>\n<li>Minimize the use of comments and only use them when necessary.</li>\n<li>Write comments to emphasize important points or parts that need future work.</li>\n</ul>\n</li>\n<li>Comment Writing Rules\n<ul>\n<li>Comments should be clear and concise.</li>\n<li>Comments should be written in appropriate amounts relative to the code. Excessive comments can reduce code readability.</li>\n<li>Comments should be written where needed, and unnecessary comments should be deleted.</li>\n<li>Comments should be updated according to code changes.</li>\n</ul>\n</li>\n</ol>\n<p>Comments help make code easier to understand and maintain. Write appropriate comments to keep code clear and meaningful.</p>\n<h3 id=\"heading-7\">2.6. Naming Conventions</h3>\n<p>Consistent naming conventions are important for maintaining code readability and consistency. Below are guidelines for naming conventions.</p>\n<ol>\n<li>Variable and Constant Naming\n<ul>\n<li>Meaning Conveyance: Variable and constant names should explain their values well. Other developers should be able to understand the role and purpose of variables from their names.</li>\n<li>Camel Case: Use camelCase for variable and constant names. Start the first word with a lowercase letter and capitalize the first letter of subsequent words. Example: firstName, userAge</li>\n<li>Readability: Set appropriate variable lengths. Too short can make meaning unclear, too long can reduce readability.</li>\n</ul>\n</li>\n<li>Function and Method Naming\n<ul>\n<li>Verb Form: Function and method names should start with verbs. Choose verbs that well describe the functioning feature. Example: getUserData, calculateTotal</li>\n<li>Camel Case: Use camelCase for function and method names. Start the first word with a lowercase letter and capitalize the first letter of subsequent words. Example: fetchData, updateProfile</li>\n</ul>\n</li>\n<li>Component Naming\n<ul>\n<li>Pascal Case: Use PascalCase for component names. Capitalize the first letter of every word with no spaces between words. Example: UserService, HomePage</li>\n<li>Clear Role: Class and component names should clearly convey their roles. Other developers should be able to understand the role of the class or component from its name.</li>\n</ul>\n</li>\n<li>Folder Directory File Naming: All files in src folders except routes and type folders should be unified as index.\n<ul>\n<li>Component Folders\n<ul>\n<li>Capital Letters and Pascal Case: File names should start with a capital letter with no spaces between words</li>\n</ul>\n</li>\n<li>Other Folders\n<ul>\n<li>Lowercase and Hyphens: File names should be written in lowercase, with multiple words separated by hyphens. Example: user-service.js, home-page.tsx</li>\n</ul>\n</li>\n<li>File Extensions: Set file extensions according to the file type. Example: .ts, .tsx</li>\n</ul>\n</li>\n</ol>\n<p>Following consistent naming conventions improves code readability and maintains consistency in collaboration. Ensure all developers share and follow naming conventions.</p>\n<h3 id=\"heading-8\">2.7. Code Formatting</h3>\n<p>Consistent code formatting improves readability and facilitates collaboration.</p>\n<p>Below are guidelines for code formatting, organized in order.</p>\n<ul>\n<li>\n<p>Leave one line between major categories (1,2,3...)</p>\n</li>\n<li>\n<p>Do not leave lines between subcategories (a,b,c...)</p>\n<ol>\n<li>\n<p>import Module</p>\n<pre><code class=\"language-jsx\">import {\n  Box,\n  Flex,\n  FormControl,\n  FormLabel,\n  Input,\n} from \"@chakra-ui/react\";\nimport { useMemo } from \"react\";\nimport { useForm } from \"react-hook-form\";\n\nimport { CodeSelect } from \"@mobyen-frontend/common\";\nimport useUserRoles from \"features/user/hooks/useUserRoles\";\n</code></pre>\n<ol>\n<li>External modules: Sort alphabetically based on what comes after from</li>\n<li>Internal modules: Sort alphabetically based on what comes after from</li>\n</ol>\n</li>\n<li>\n<p>interface: Sort contents alphabetically within scope</p>\n<pre><code class=\"language-jsx\">interface SearchPanelProps {\n  isSearching: boolean;\n  onChange: (param: {\n    email: string | null,\n    ext: string | null,\n    mobile: string | null,\n    name: string | null,\n    tel: string | null,\n    userRole: string | null,\n    useYN: string | null,\n  }) =&gt; void;\n  onReset: () =&gt; void;\n}\n</code></pre>\n</li>\n<li>\n<p>defaultProps: Sort contents alphabetically within scope</p>\n<pre><code class=\"language-jsx\">const defaultProps = {\n  isSearching: false,\n  onChange(_param: {\n    email: null,\n    ext: null,\n    mobile: null,\n    name: null,\n    tel: null,\n    userRole: null,\n    useYN: null,\n  }) {},\n  onReset() {},\n};\n</code></pre>\n</li>\n<li>\n<p>component</p>\n<pre><code class=\"language-jsx\">function SearchPanel({ isSearching, onChange, onReset }: SearchPanelProps) {\n  const { handleSubmit, register, reset, resetField } = useForm&lt;{\n    search: string;\n    searchType?: \"email\" | \"ext\" | \"mobile\" | \"name\" | \"tel\";\n    useYN: string;\n    userRole: string;\n  }&gt;();\n\n  const { data: userRoles } = useUserRoles({ publicYN: \"Y\" });\n\n  const handleFormSubmit = handleSubmit(\n    ({ search, searchType, userRole, useYN }) =&gt; {\n      let email = null;\n      let ext = null;\n      let mobile = null;\n      let name = null;\n      let tel = null;\n      if (searchType) {\n        email = searchType === \"email\" ? search : null;\n        ext = searchType === \"ext\" ? search : null;\n        mobile = searchType === \"mobile\" ? search : null;\n        name = searchType === \"name\" ? search : null;\n        tel = searchType === \"tel\" ? search : null;\n      } else {\n        resetField(\"search\");\n      }\n      onChange({\n        email: email ?? null,\n        ext: ext ?? null,\n        mobile: mobile ?? null,\n        name: name ?? null,\n        tel: tel ?? null,\n        userRole: userRole ? userRole : null,\n        useYN: useYN ? useYN : null,\n      });\n    }\n  );\n\n  const handleResetButtonClick = () =&gt; {\n    reset();\n    onReset();\n  };\n\n  const userRoleOptions = useMemo(\n    () =&gt;\n      userRoles?.map((role) =&gt; ({\n        code: String(role.id),\n        name: role.name ?? \"\",\n      })) ?? [],\n    [userRoles]\n  );\n  const searchTypeOption = [\n    {\n      code: \"name\",\n      name: \"Name\",\n    },\n    {\n      code: \"email\",\n      name: \"Email\",\n    },\n    {\n      code: \"tel\",\n      name: \"Phone Number\",\n    },\n    {\n      code: \"ext\",\n      name: \"Extension Number\",\n    },\n    {\n      code: \"mobile\",\n      name: \"Mobile Number\",\n    },\n  ];\n\n  return (\n    &lt;Flex\n      as=\"form\"\n      flexDirection=\"column\"\n      gap={2}\n      onSubmit={handleFormSubmit}\n      width=\"100%\"\n    &gt;\n      &lt;Box\n        borderBottomColor=\"black\"\n        borderBottomWidth=\"1px\"\n        borderTopColor=\"black\"\n        borderTopWidth=\"1px\"\n        p={3}\n      &gt;\n        &lt;FormControl&gt;\n          &lt;FormLabel fontSize=\"xs\" fontWeight=\"bold\" htmlFor=\"userRole\"&gt;\n            Search Conditions\n          &lt;/FormLabel&gt;\n          &lt;Flex flexWrap=\"wrap\" gap={2}&gt;\n            &lt;CodeSelect\n              codes={userRoleOptions}\n              flex={{ md: 1 }}\n              id=\"userRole\"\n              minWidth={{ md: \"150px\" }}\n              maxWidth={{ lg: \"200px\" }}\n              placeholder=\"Role\"\n              {...register(\"userRole\")}\n            /&gt;\n            &lt;CodeSelect\n              codes={[\n                { code: \"Y\", name: \"In Use\" },\n                { code: \"N\", name: \"Not in Use\" },\n              ]}\n              flex={{ sm: 1 }}\n              id=\"useYN\"\n              maxWidth={{ lg: \"200px\" }}\n              minWidth={{ md: \"150px\" }}\n              placeholder=\"Usage Status\"\n              {...register(\"useYN\")}\n            /&gt;\n            &lt;CodeSelect\n              codes={searchTypeOption}\n              flex={{ sm: 1 }}\n              id=\"searchType\"\n              maxWidth={{ lg: \"170px\" }}\n              minWidth={{ md: \"130px\" }}\n              placeholder=\"Search Condition\"\n              {...register(\"searchType\")}\n            /&gt;\n            &lt;Input\n              flex={{ md: 2 }}\n              id=\"search\"\n              maxWidth={{ lg: \"300px\" }}\n              minWidth={{ md: \"200px\" }}\n              placeholder=\"Search Term\"\n              {...register(\"search\")}\n            /&gt;\n            &lt;Input\n              disabled={isSearching}\n              hidden\n              id=\"searchButton\"\n              type=\"submit\"\n            /&gt;\n            &lt;Input\n              hidden\n              id=\"resetButton\"\n              type=\"button\"\n              onClick={handleResetButtonClick}\n            /&gt;\n          &lt;/Flex&gt;\n        &lt;/FormControl&gt;\n      &lt;/Box&gt;\n    &lt;/Flex&gt;\n  );\n}\n</code></pre>\n<ol>\n<li>React hooks: Sort alphabetically based on declaration name</li>\n<li>Custom hooks: Sort alphabetically based on declaration name</li>\n<li>useState: Sort alphabetically based on first state variable</li>\n<li>function: Sort alphabetically based on declaration name</li>\n<li>useEffect</li>\n<li>watch functions</li>\n</ol>\n</li>\n<li>\n<p>defaultProps</p>\n<pre><code class=\"language-jsx\">SearchPanel.defaultProps = defaultProps;\n</code></pre>\n</li>\n<li>\n<p>export default</p>\n<pre><code class=\"language-jsx\">export default SearchPanel;\n</code></pre>\n</li>\n</ol>\n</li>\n</ul>\n<h3 id=\"heading-9\">2.8. Error Handling</h3>\n<p>Properly handling errors in applications improves stability and response to exceptional situations. Below are guidelines for error handling.</p>\n<ol>\n<li>Exception Handling: Implement appropriate exception handling for code blocks where exceptions may occur. This involves using try-catch statements to catch exceptions, outputting appropriate log messages, or displaying error messages to users.</li>\n<li>Error Handling: Implement error handling at the highest level of the application. This involves displaying notifications and providing appropriate guidance to users when unexpected exceptions occur.</li>\n<li>Logging: Record logs and include traceable information when errors occur. This can help with debugging and problem-solving.</li>\n<li>User Feedback: Provide appropriate feedback to users when errors occur. This can help users understand and deal with problem situations.</li>\n<li>Exception Handling Module: Modularize handling of common exceptions in the application to improve reusability.</li>\n</ol>\n<p>It's good to consider potential exceptional situations in advance and implement appropriate error handling to improve stability and user experience.</p>\n<h2 id=\"heading-10\">3. Project Structure</h2>\n<h3 id=\"heading-11\">3.1. File and Folder Structure</h3>\n",
      "tocItems": [
        {
          "id": "heading-0",
          "text": "1. Purpose",
          "level": 2,
          "isMainTopic": true,
          "position": 0
        },
        {
          "id": "heading-1",
          "text": "2. Coding Style Guide",
          "level": 2,
          "isMainTopic": true,
          "position": 50
        },
        {
          "id": "heading-2",
          "text": "2.1. Indentation",
          "level": 3,
          "isMainTopic": false,
          "position": 100
        },
        {
          "id": "heading-3",
          "text": "2.2. Variables and Constants",
          "level": 3,
          "isMainTopic": false,
          "position": 150
        },
        {
          "id": "heading-4",
          "text": "2.3. Functions and Methods",
          "level": 3,
          "isMainTopic": false,
          "position": 200
        },
        {
          "id": "heading-5",
          "text": "2.4. Components",
          "level": 3,
          "isMainTopic": false,
          "position": 250
        },
        {
          "id": "heading-6",
          "text": "2.5. Comments",
          "level": 3,
          "isMainTopic": false,
          "position": 300
        },
        {
          "id": "heading-7",
          "text": "2.6. Naming Conventions",
          "level": 3,
          "isMainTopic": false,
          "position": 350
        },
        {
          "id": "heading-8",
          "text": "2.7. Code Formatting",
          "level": 3,
          "isMainTopic": false,
          "position": 400
        },
        {
          "id": "heading-9",
          "text": "2.8. Error Handling",
          "level": 3,
          "isMainTopic": false,
          "position": 450
        },
        {
          "id": "heading-10",
          "text": "3. Project Structure",
          "level": 2,
          "isMainTopic": true,
          "position": 500
        },
        {
          "id": "heading-11",
          "text": "3.1. File and Folder Structure",
          "level": 3,
          "isMainTopic": false,
          "position": 550
        }
      ]
    }
  },
  "imageHeights": {}
}